БИТУправление_медицинским_центром_демо/src/Catalogs/ГруппыОбъектовМетаданных/ГруппыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ИмяМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выгружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ГруппыОбъектовМетаданных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Дополнить(Команда)
	ДополнитьСервер();	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСервер()
	ВнОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ГруппыОбъектовМетаданных"));
	ВнОбъект.Дополнить();
	ЗначениеВРеквизитФормы(ВнОбъект, "Объект");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыделитьВсеМетаданные(Команда)
	
	Для Каждого СтрокаСостава Из Объект.Состав Цикл
		СтрокаСостава.Выгружать = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВедылениеВсеМетаданные(Команда)
	
	Для Каждого СтрокаСостава Из Объект.Состав Цикл
		СтрокаСостава.Выгружать = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
